amber
aromas
autumn
bale
bonfire
bounty
brisk
carving
chestnuts
chilly
chili
cider
cinnamon
colony
cornstalk
cornucopia
costume
cranberry
crisp
crunching
family
feast
frosty
gathering
ghost
ghoulish
gingerbread
goblin
golden
gourds
gravy
grandparents
Halloween
harvest
haunted
hayride
holiday
inviting
leaf-strewn
mask
Mayflower
maize
maze
mummy
November
October
orchard
parade
Pilgrims
Plymouth
pumpkin
quarterback
raking
roasting
rust-colored
rustling
savory
scarecrow
season
September
settlers
spicy
sweater
tailgate
thankful
Thanksgiving
trick-or-treat
turkey
trail
vampire
vibrant
yams
zombie
Abundance
America
Anxiety
Appetite
Apple cider
Apple pie
Appreciation
Aroma
Arrangement
Assemble
Autumn
Awe
Baking
Belonging
Beloved
Berries
Blessings
Bouquet
Bread
Brood
Candles
Care
Carve
Casserole
Cater
Celebrate
Celebration
Ceremony
Cherry pie
Chocolate
Church
Cider
Clan
Cloves
Collective
Colonist
Colony
Comfort
Community
Companionship
Conversation
Cook
Cooperative
Corn
Corn meal
Corn stalk
Cornbread
Cornucopia
Cranberries
Crops
Crowds
Decorations
Deep-seated
Delicacy
Delicious
Delight
Dinner
Dish
Dress up
Dressing
Duck
Eating
Efforts
Egg bread
Embrace
Entertain
Expectations
Fall
Familial
Familiar
Family
Famished
Favorite
Feast
Feeding
Festive
Fireplace
Fireside
Float
Flowers
Food
Freedom
Fried turkey
Friends
Friendship
Full
Gather
Gathering
Generations
Giblets
Giving
Gizzard
Gobble
God
Goose
Gooseberry pie
Gourd
Gourmet
Gratitude
Gravy
Green beans
Groceries
Groups
Guests
Ham
Harvest
Hearth
Heartland
Helping
Heritage
Holding hands
Holiday
Home
Homecoming
Homeward
Hope
Horn of plenty
Hospitality
Host
Hostess
Hot chocolate
Hugs
Hymns
Ice cream
Immigrate
Indian corn
Indians
Indigenous
Invite
Jam
Jellies
Journey cake
Joy
Joyful
Kale
Kernels
Kisses
Kitchen
Laughter
Legal federal holiday
Libation
Love
Maize
Mashed potatoes
Massachusetts
Mayflower
Meleagris gallopavo (scientific name)
Memories
Mince meat pie
Minister
Mixture
Mood
Native American
Network
New World
November
Nutcrackers
Nutmeg
Nuts
Observances
Occasion
Onions
Pals
Parade
Peace
Picture perfect
Pies
Pilgrims
Plantation
Plentiful
Plum pudding
Plum sauce
Plymouth Colony
Plymouth Rock
Poult (baby turkey)
Prayer
Pride
Priest
Priorities
Pumpkin pie
Puritans
Quince pie
Rabbi
Reflections
Refuge
Rejoice
Relationship
Relatives
Relaxation
Religion
Religious
Relish
Reunions
Ritual
Roast
Roast turkey
Rolls
Roots
Rutabaga
Sacred
Sage
Satiated
Sauce
Seasonings
Settlers
Sharing
Sigh
Spices
Squanto
Squash
Stress
Stuffing
Succotash
Sustenance
Sweet potato
Symbol
Synagogue
Table setting
Thanks
Thanksgiving
Thursday
Tom turkey
Tradition(s)
Travel
Treaty
Trimmings
Trips
Turnips
Understanding
Unify
Unique
Universal
Vacation
Vanilla
Vegetable
Vegetarian
Venison
Viewpoint
Vision
Warmth
Wassail
Wattle
Welcome
Wild turkeys
William Bradford
Winter
Worship
Worshipers
Yams
Yells
Yorkshire pudding
Zany
Zesty
Zucchini
Abundance
America
Anxiety
Appetite
Apple cider
Apple pie
Appreciation
Aroma
Arrangement
Assemble
Autumn
Awe
Baking
Belonging
Beloved
Berries
Blessings
Bouquet
Bread
Brood
Candles
Care
Carve
Casserole
Cater
Celebrate
Celebration
Ceremony
Cherry pie
Chocolate
Church
Cider
Clan
Cloves
Collective
Colonist
Colony
Comfort
Community
Companionship
Conversation
Cook
Cooperative
Corn
Corn meal
Corn stalk
Cornbread
Cornucopia
Cranberries
Crops
Crowds
Decorations
Deep-seated
Delicacy
Delicious
Delight
Dinner
Dish
Dress up
Dressing
Duck
Eating
Efforts
Egg bread
Embrace
Entertain
Expectations
Fall
Familial
Familiar
Family
Famished
Favorite
Feast
Feeding
Festive
Fireplace
Fireside
Float
Flowers
Food
Freedom
Fried turkey
Friends
Friendship
Full
Gather
Gathering
Generations
Giblets
Giving
Gizzard
Gobble
God
Goose
Gooseberry pie
Gourd
Gourmet
Gratitude
Gravy
Green beans
Groceries
Groups
Guests
Ham
Harvest
Hearth
Heartland
Helping
Heritage
Holding hands
Holiday
Home
Homecoming
Homeward
Hope
Horn of plenty
Hospitality
Host
Hostess
Hot chocolate
Hugs
Hymns
Ice cream
Immigrate
Indian corn
Indians
Indigenous
Invite
Jam
Jellies
Journey cake
Joy
Joyful
Kale
Kernels
Kisses
Kitchen
Laughter
Legal federal holiday
Libation
Love
Maize
Mashed potatoes
Massachusetts
Mayflower
Meleagris gallopavo (scientific name)
Memories
Mince meat pie
Minister
Mixture
Mood
Native American
Network
New World
November
Nutcrackers
Nutmeg
Nuts
Observances
Occasion
Onions
Pals
Parade
Peace
Picture perfect
Pies
Pilgrims
Plantation
Plentiful
Plum pudding
Plum sauce
Plymouth Colony
Plymouth Rock
Poult (baby turkey)
Prayer
Pride
Priest
Priorities
Pumpkin pie
Puritans
Quince pie
Rabbi
Reflections
Refuge
Rejoice
Relationship
Relatives
Relaxation
Religion
Religious
Relish
Reunions
Ritual
Roast
Roast turkey
Rolls
Roots
Rutabaga
Sacred
Sage
Satiated
Sauce
Seasonings
Settlers
Sharing
Sigh
Spices
Squanto
Squash
Stress
Stuffing
Succotash
Sustenance
Sweet potato
Symbol
Synagogue
Table setting
Thanks
Thanksgiving
Thursday
Tom turkey
Tradition(s)
Travel
Treaty
Trimmings
Trips
Turnips
Understanding
Unify
Unique
Universal
Vacation
Vanilla
Vegetable
Vegetarian
Venison
Viewpoint
Vision
Warmth
Wassail
Wattle
Welcome
Wild turkeys
William Bradford
Winter
Worship
Worshipers
 
Yams
Yells
Yorkshire pudding
Zany
Zesty
Zucchini
Acclaim
Action
Activities
Admiration
Affordable
Allure
Americana
Amusement
Anniversary
Appreciation
Ardent
Art
Attachments
Attitude
Awareness
Awesome
Ball game
Band
Bandanna
Banners
Barricades
Baton twirling
Beads
Beware
Blessings
Boisterous
Bookings
Bouquets
Breathtaking
Cavalcade
Celebrate
Celebration
Chant
Charming
Checkered table cloths
Citizen(s)
Citizenship
Civic
Clamor
Colorful
Commemorate
Commercial
Common
Communication
Community
Companionship
Cooperation
Coordinate
Costume
Countryside
Crescendo
Culinary
Cultural
Dazzling
Deafening
Debauchery
Declaration
Decoration
Delightful
Dessert
Devotion
Dice
Dignitaries
Dignity
Disturbance
Dramatic
Drinking
Ebullient
Elaborate
Embellishments
Emotional
En masse
Encounter
Endure
Energy
Engulf
Entertainment
Equine
Event
Exchanges
Exhibitions
Expectations
Explode
Explosion
Eye-raising
Fabulous
Fair
Family
Fanciful
Fascination
Feast
Feeling
Ferris Wheel
Festival
Firecracker(s)
Fireworks
Flag
Flavor
Focus
Food
Foolishness
Freedom
Friendships
Frivolity
Fun
Gamble
Games
Gardens
Gatherings
Glitter
Glory
Goal(s)
Grandeur
Group
Habitual
Haste
Heat
Herald
Heritage
History
Holiday
Home
Hooray
Hope(s)
Horrific
Horses
Hospitality
Hot
Hotel
Humble
Humidity
Ideal(s)
Illusions
Imagination
Imitate
Immortality
Importance
Impressive
Indulgence
Influence
Informative
Insight
Integral
Involvement
Jeans
Join
Joking
Jolly
Joy
Joyful
Joyous
Juggling
July
Keen
Kin
Kindness
Kiss
Kitsch
Laughter
Lava
Legendary
Liberty
Local
Locale
Love
Loyalty
Major
Major
Maraud
March
Mardi Gras
Mask
Masses
Memorial
Memories
Merriment
Merrymaking
Military
Minor
Money
Music
Musical
Mutual
Nation
National
Native
Nibble
Nocturnal
Occasion
Odious
Official(s)
Opportunities
Opportunity
Outdoors
Overwhelming
Paper-mache
Parade
Participation
Parties
Passionate
Patriot
Patriotic
Patriotism
Perennial
Photography
Pick pocket
Pickles
Picnic
Playful
Pomp
Popular
Presentation
Preservation
Pride
Prizes
Public service
Punch
Pyrotechnics
Quaint
Queen
Quick
Quiet
Rambling
Recreation
Refreshment
Rejoicing
Relatives
Relaxation
Reputation
Responsibility
Restful
Reveal
Revelation
Rituals
Roam
Roar
S: scene
Service
Sharing
Shindig
Shows
Shrieking
Shrine
Sidewalk
Smiles
Solemn
Souvenir
Sparkle
Special
Spectacle
Spirit
Sports
Stars
Storyteller
Streamers
Stripes
Stroll
Stunning
Summer
Sunburn
Super-patriot
Support
Surprise
Swimming
Symbol
Symbolism
Taffy
Target
Tea
Territory
Theatrical
Tickets
Toasting
Tourism
Traditions
Travel
Tribute
Unaware
Unbelievable
Unification
Uniform
Union
Unique
Unite
Universal
Vacation
Valuable
Values
Variety
Vendor
Versatile
Veteran
Vibrant
Victory
Vigilance
Vital
Vivacious
Wallet
Wardrobe
Watch
Wave
Waving
Welcome
Welfare
Widespread
Willingness
Winter
Wisdom
Worldwide
Yearn
Yelling
Youth
Zeal
Zealous
Zest
Adorable
Ambrosial
Appealing
Appetizing
Aroma
Array
Cheese
Choice
Choices
Dainty
Darling
Delectable
Delightful
Delish
Desserts
Distinctive
Divine
Enchanting
Enjoyable
Enticing
Exquisite
Finger-licking good
Fit for king
Flavorful
Flavorsome
Food
Fruit
Good
Gratifying
Heavenly
Lovely
Luscious
Luscious
Lush
Meat
Mellow
Mouthwatering
Nectar-like
Nice
Numerous
Palatable
Peppery
Piquant
Pleasant
Pleasurable
Presentation
Rare
Rich
Salty
Sapid
Savory
Scrumptious
Sense
Sensory
Smell
Spicy
Succulent
Sweet
Tasteful
Tasty
Tempting
Titillating
Toothsome
Well-prepared
Well-seasoned
Wonderful
Yummy
Yummy. delicate
Zesty
